package Lesson2.Homework;

public class Task6 {
    public static void main(String[] args) {
//        Напишите программу вывода всех четных чисел от 2 до 100 включительно

        int i = 2;

        while (i <= 100) {
            System.out.println(i);
            i += 2;
        }
    }
}
